{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_XFDJpK":{"type":"rich-text","blocks":{"heading_8dtdf4":{"type":"heading","settings":{"heading":"{{ page.title }}","heading_size":"h2"}},"text_dwmnLB":{"type":"text","settings":{"text":"<p>Sehgal Motorsports was established in 1979 and it is now one of the leading companies in the automotive industry. Established by Nadeem Rafiq Sehgal more than 40 years ago, with Hamid Sehgal as the current CEO, the company has two branches and great popularity. Our products include car accessories, modification parts, decoration items, gadgets, mobile accessories, facelift conversions, and body kits, for which we offer nothing but the best of our services. Our commitment has placed us ahead as the pioneers of automotive e-commerce in Pakistan.<\/p><p>Sehgal Motorsports provides new and used cars, bikes, auto parts, and accessories and is sold at the lowest prices in the market. We are the first and only private SSS (Sales, Service, Spare part) car dealer in Pakistan. we provide an all-under-one-roof solution and a comprehensive e-commerce marketplace. Our services include a vast range of products such as modification, decoration parts, gadgets, body conversions, mobile accessories, and car care solutions. Sehgal Motorsports has built a lot of trust and followership with millions of people on social media platforms. We are proud of being the most trusted car accessories and modification store in Pakistan and it is evident from the fact that every second car in the country has been modified by us.<\/p><p>We have our head office in Rawalpindi Saddar Cantt and a flagship branch on GT Road in Islamabad. We offer over 150 local and international brands on our online shopping platform, allowing customers to enjoy superior products and policies. We have evolved into the ultimate customized car destination and home to a team of experienced technicians, fabricators, designers, electricians, painters, and many others. To help our customers even more, we provide online services at our e-shop, Sehgalmotorsports.pk, offering the latest auto news and updates, current car prices, and a large selection of over 15,000 high-quality products. We accept COD, free shipping across the country, and free returns within 7 days of delivery. This makes it possible for the company to meet the customer’s needs by guiding them to the right products to assist them in their purchasing decisions.<\/p>"}}},"block_order":["heading_8dtdf4","text_dwmnLB"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}},"multicolumn_X9UT3j":{"type":"multicolumn","blocks":{"column_AH9UqW":{"type":"column","settings":{"title":"<strong>Comprehensive Product Range<\/strong>","text":"<p>Our product line includes cars and motorcycles, auto parts, and accessories with over 15,000 products of high quality. These include modification and decoration parts, gadgets, body conversions, mobile accessories, car care solutions, and much more.<\/p>","link_label":"","link":""}},"column_TaQRnq":{"type":"column","settings":{"title":"<strong>Trusted Brands<\/strong>","text":"<p>With two stores sourced locally and from across the globe, our online store is stocked with the latest products that are on the market.<\/p>","link_label":"","link":""}},"column_zY43Fr":{"type":"column","settings":{"title":"<strong> Convenient Online Shopping<\/strong>","text":"<p>As a result of our e-commerce platform, a customer can shop for any product of their choice without leaving the comfort of their home. To ensure convenience, we ship items across the country and provide a cash-on-delivery option. <\/p>","link_label":"","link":""}},"column_dTrtRV":{"type":"column","settings":{"title":"<strong>Customer-Centric Policies<\/strong>","text":"<p>Our return policy for our consumers is 7 days which shows that we care for their satisfaction when making their purchases with us.<\/p>","link_label":"","link":""}},"column_tVMexy":{"type":"column","settings":{"title":"<strong>Expert Team<\/strong>","text":"<p>We employ a team of competent technicians, fabricators, designers, electricians, painters, and other personnel. Such experience enables us to provide the best value and to develop solutions that can be tailored to meet the specific needs of the customers.<\/p>","link_label":"","link":""}},"column_wKfJRr":{"type":"column","settings":{"title":"<strong>One-Stop Shop<\/strong>","text":"<p>We also sell New & Used cars like Toyota, Honda, Haval, Suzuki, Hyundai, Kia, and the New Baic. As the first of our kind in the country to open the first and only private SSS car dealership, we provide Sales, Service, and Spare parts. This strategy gives our customers a one-stop-shop for all their needs, whether it is in sales and services, or replacement spares.<\/p>","link_label":"","link":""}},"column_TBpa8V":{"type":"column","settings":{"title":"<strong> Latest Industry Updates<\/strong>","text":"<p>We share with our customers the most recent information on the auto industry, along with the current prices for automobiles and the relevant promotions.<\/p>","link_label":"","link":""}},"column_f66pcD":{"type":"column","settings":{"title":"<strong>Customer Loyalty<\/strong>","text":"<p>By treating everyone fairly and with integrity, we are now associated with virtue and many customers come to us for their automotive needs. This is in line with our provision of quality goods and services that make the customers continue patronizing our business.<\/p>","link_label":"","link":""}}},"block_order":["column_AH9UqW","column_TaQRnq","column_zY43Fr","column_dTrtRV","column_tVMexy","column_wKfJRr","column_TBpa8V","column_f66pcD"],"settings":{"enable_custom_arrows_style":false,"show_counter":true,"title":"<strong>What makes Sehgal Motorsports special?<\/strong>","heading_size":"h2","image_width":"full","image_ratio":"adapt","columns_desktop":4,"column_alignment":"left","background_style":"primary","button_label":"","button_link":"","color_scheme":"","columns_mobile":"1","swipe_on_mobile":false,"padding_top":36,"padding_bottom":36}},"image_with_text_4b8ynV":{"type":"image-with-text","blocks":{"heading_9FKF9M":{"type":"heading","settings":{"heading":"What makes Sehgal Motorsports special?","heading_size":"h2"}},"text_cizRMb":{"type":"text","settings":{"text":"<p><strong> As pioneers in Pakistan, SEHGAL MOTORS is the first and only private dealership offering an SSS (Sales, Service, Spare parts) model, providing an all-in-one automotive solution under one roof. Beyond our physical presence, we have established an extensive e-commerce marketplace, catering to enthusiasts with a wide range of products including car modifications, decorative parts, gadgets, body conversions, mobile accessories, and comprehensive car care solutions.<\/strong><\/p><p><\/p>","text_style":"body"}},"button_PEPEHc":{"type":"button","disabled":true,"settings":{"button_label":"Button label","button_link":"","button_style_secondary":false}}},"block_order":["heading_9FKF9M","text_cizRMb","button_PEPEHc"],"disabled":true,"settings":{"image":"shopify:\/\/shop_images\/WhatsApp_Image_2024-05-29_at_6.32.51_PM_2.jpg","enable_border_radius":false,"height":"adapt","desktop_image_width":"medium","layout":"image_first","desktop_content_position":"middle","desktop_content_alignment":"left","content_layout":"no-overlap","section_color_scheme":"","color_scheme":"","image_behavior":"none","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}},"image_with_text_YbTiCm":{"type":"image-with-text","blocks":{"text_wQBgkP":{"type":"text","settings":{"text":"<p>Our head Office is located in Rawalpindi Saddar Cantt and a flagship branch as SEHGAL MOTORSPORTS on GT Road Islamabad. This strategic positioning allows us to efficiently serve a broad customer base, both in-person and online. Our online platform showcases an impressive portfolio of over 150 local and international brands, solidifying our reputation for quality and reliability. Sehgal Motors is the ultimate destination for car customization, supported by a talented team of veteran technicians, fabricators, designers, electricians, painters, and more. Each day, our skilled team strives to create bespoke, artistic automotive masterpieces for our clients.<\/p><p>To further enhance customer convenience, we offer robust online services through our e-commerce portal,<strong>www.sehgalmotorsports.pk<\/strong>. This platform is a hub of the latest automotive industry news, updates, and current car prices. It also features an extensive catalog of over 7000 high-quality products, ensuring our customers have access to the best in automotive parts and accessories. At Sehgal Motors, we are committed to exceeding customer expectations and providing a seamless, comprehensive shopping experience for all your automotive needs.<\/p>","text_style":"body"}}},"block_order":["text_wQBgkP"],"disabled":true,"settings":{"image":"shopify:\/\/shop_images\/2022-08-29_1.jpg","enable_border_radius":false,"height":"adapt","desktop_image_width":"medium","layout":"text_first","desktop_content_position":"top","desktop_content_alignment":"left","content_layout":"no-overlap","section_color_scheme":"","color_scheme":"","image_behavior":"none","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}}},"order":["main","rich_text_XFDJpK","multicolumn_X9UT3j","image_with_text_4b8ynV","image_with_text_YbTiCm"]}